# Pandas

- Analyse 2D or multi dimensional data 
- Table like data 
- Internally they use numpy

In [ ]:
# %pip install pandas

## Creating data

- Dictionaries
- import from csv

final dat will be a DataFrame (Table)

In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}

data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 32],
 'City': ['New York', 'Paris', 'Berlin', 'London']}

In [4]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

### Filerting column

In SQL:
```sql
SELECT name FROM df
```

In [5]:
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [6]:
print(type(df))
print(type(df['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

python dataframes faster than databases as it is kept in memory 

Filtering rows using `head(index)`

In [10]:
df.head(2)

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

## Info

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [13]:
print(df.shape) # rows and columns (dimensions of dataframe)
df.dtypes # Datatypes

(4, 3)

Name    object
Age      int64
City    object
dtype: object

In [14]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [44]:
display(df.describe()) # info only on numeric columns
df.describe(include="all")

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

Data grabbed from tips.csv

In [38]:
tips_df = pd.read_csv("./tips.csv") # can pass url to read data 
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [29]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

### Select Day, Time, Tip

In [28]:
tips_df[['day','time','tip']] # multiple column

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [39]:
tips_df.describe().mean()

total_bill    47.729794
tip           33.480552
size          32.690096
dtype: float64

Adding a new column

In [51]:
display(tips_df[['tip','size']].head(5))
tips_df['tips_per_person'] =tips_df['tip']/tips_df['size']
tips_df.tail(10)

    tip  size
0  1.01     2
1  1.66     3
2  3.50     3
3  3.31     2
4  3.61     4

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
234,15.53,3.00,Male,Yes,Sat,Dinner,2,1.500000,19.32
235,10.07,1.25,Male,No,Sat,Dinner,2,0.625000,12.41
236,12.60,1.00,Male,Yes,Sat,Dinner,2,0.500000,7.94
237,32.83,1.17,Male,Yes,Sat,Dinner,2,0.585000,3.56
238,35.83,4.67,Female,No,Sat,Dinner,3,1.556667,13.03
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

### Find the percentage that people are tipping 
- percentage 
- add as another column - tip_percentage
- round to 2 decimall points
- `20.34` not be `0.2034`

In [50]:
tips_df['tip_percentage'] = round(tips_df['tip']/tips_df['total_bill'] * 100,2)
tips_df.head(5)

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68